Revit 2024 API
RebarFreeFormAccessor.SetCurves Method
Overload List
Name | Description
SetCurves(IList<IList<Curve>>)
 Set the curves into a free form Rebar. Will throw exception if the rebar has valid constraints.
SetCurves(IList<CurveLoop>)
 Set the curves into a free form Rebar. Will throw exception if the rebar has valid constraints.
See Also
RebarFreeFormAccessor Class
RebarFreeFormAccessor Members
Autodesk.Revit.DB.Structure Namespace